{"class_name": "Model", "config": {"name": "model_1", "layers": [{"name": "movie", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "name": "movie"}, "inbound_nodes": []}, {"name": "kw", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "name": "kw"}, "inbound_nodes": []}, {"name": "movie_embedding", "class_name": "Embedding", "config": {"name": "movie_embedding", "trainable": true, "batch_input_shape": [null, null], "dtype": "float32", "input_dim": 29819, "output_dim": 100, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": null}, "inbound_nodes": [[["movie", 0, 0, {}]]]}, {"name": "kw_embedding", "class_name": "Embedding", "config": {"name": "kw_embedding", "trainable": true, "batch_input_shape": [null, null], "dtype": "float32", "input_dim": 17624, "output_dim": 100, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": null}, "inbound_nodes": [[["kw", 0, 0, {}]]]}, {"name": "dot_product", "class_name": "Dot", "config": {"name": "dot_product", "trainable": true, "axes": 2, "normalize": true}, "inbound_nodes": [[["movie_embedding", 0, 0, {}], ["kw_embedding", 0, 0, {}]]]}, {"name": "reshape_1", "class_name": "Reshape", "config": {"name": "reshape_1", "trainable": true, "target_shape": [1]}, "inbound_nodes": [[["dot_product", 0, 0, {}]]]}], "input_layers": [["movie", 0, 0], ["kw", 0, 0]], "output_layers": [["reshape_1", 0, 0]]}, "keras_version": "2.2.0", "backend": "tensorflow"}